/*
*	УСЛОВИЕ:
*	Имеется n веществ. 
*	Задана таблица взаимодействия:
*	некоторым парам веществ ставится в соответствие вешество, 
*	получаемое в результате их взаимодействия. 
*	Задана последовательность помещения веществ в пробирку. 
*	Если в пробирке рядом оказываются реагирующие вещества, 
*	они мгновенно превращаются в третье вешество согласно таблице. 
*	Определите, какие вещества останутся в пробирке.
*	
*	Author: Kalabin Danil
*/

#include <iostream>

using namespace std;

int main() {
	
	return 0;
}